def area(a, b): 
    '''
    Возвращает площадь прямоугольника.
    
            Параметры:
                a (int): длина первой стороны
                b (int): длина второй стороны
            Возвращаемое значение:
                area (int): площадь прямоугольника со сторонами a и b
    '''
    return a * b 

def perimeter(a, b): 
    '''
    Возвращает периметр прямоугольника.

            Параметры:
                a (int): длина первой стороны
                b (int): длина второй стороны
            Возвращаемое значение:
                perimeter (int): периметр прямоугольника со сторонами a и b
    '''
    return 2 * (a + b) 


