def area(a, b, c):
    '''
    Возвращает площадь треугольника.

            Параметры:
                a (int): сторона треугольника 
                b (int): сторона треугольника
                c (int): сторона треугольника
            Возвращаемое значение:
                area (int): возвращает площадь треугольника
    '''
    return (a + b + c) / 2


def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника.

            Параметры:
                a (int): сторона треугольника 
                b (int): сторона треугольника
                c (int): сторона треугольника
            Возвращаемое значение:
                perimeter (int): возвращает периметр треугольника
    '''
    return a + b + c
